pmo-dataset/variations/graphviz_with_ids/16.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Submit documents"];
  "Task_2" [label="Approve report"];
  "Task_3" [label="Archive report"];
  "Task_4" [label="Send notification"];
  "Task_5" [label="Launch detailed\ninvestigation"];
  "Task_6" [label="Close audit process"];
  "Task_7" [label="Gather necessary\ndocuments"];
  "Task_8" [label="Send report for\nrevision"];
  "Task_9" [label="Compile audit report"];
  "Task_10" [label="Conduct interviews"];
  "Task_11" [label="Check regulatory\nupdates"];
  "Task_12" [label="Update and resubmit\nreport"];
  "Task_13" [label="Evaluate compliance\nrisks"];
  "Task_14" [label="Evaluate financial\nrisks"];
  "Task_15" [label="Review submission"];
  "Task_16" [label="Receive\nclarifications"];
  "Task_17" [label="Prepare financial\nstatements"];
  "Task_18" [label="Complete risk\nassessment/mitigatio\nn"];
  "Task_19" [label="Perform site visits"];
  "Task_20" [label="Review report by\naudit director"];
  "Task_21" [label="Distribute final\nreport"];
  "Task_22" [label="Conduct data\nanalysis"];
  "Task_23" [label="Request\nclarifications of\ndiscrepancies"];
  "Task_24" [label="Evaluate operational\nrisks"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ExclusiveGateway_7" [shape=diamond, label="X"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
  "ParallelGateway_5" [shape=diamond, label="+"];
  "ParallelGateway_6" [shape=diamond, label="+"];

  "ExclusiveGateway_5" -> "ExclusiveGateway_8";
  "Task_2" -> "Task_21";
  "ExclusiveGateway_4" -> "ParallelGateway_1";
  "ParallelGateway_6" -> "Task_11";
  "Task_11" -> "ParallelGateway_2";
  "Task_23" -> "Task_16";
  "Task_14" -> "ParallelGateway_3";
  "Task_17" -> "ParallelGateway_2";
  "ExclusiveGateway_5" -> "Task_5";
  "ParallelGateway_4" -> "ExclusiveGateway_7";
  "Task_5" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "Task_10";
  "ParallelGateway_5" -> "ExclusiveGateway_8";
  "Task_24" -> "ParallelGateway_3";
  "ExclusiveGateway_7" -> "Task_19";
  "ParallelGateway_6" -> "Task_17";
  "ParallelGateway_4" -> "Task_22";
  "Task_13" -> "ParallelGateway_3";
  "Task_16" -> "ExclusiveGateway_4";
  "StartNoneEvent_1" -> "Task_4";
  "Task_7" -> "ParallelGateway_2";
  "ExclusiveGateway_1" -> "ParallelGateway_5";
  "ParallelGateway_6" -> "Task_7";
  "Task_22" -> "ParallelGateway_5";
  "ExclusiveGateway_7" -> "ExclusiveGateway_1";
  "Task_10" -> "ParallelGateway_5";
  "ExclusiveGateway_3" -> "Task_2";
  "ExclusiveGateway_8" -> "Task_18";
  "ParallelGateway_1" -> "Task_14";
  "Task_8" -> "Task_12";
  "ParallelGateway_1" -> "Task_13";
  "ExclusiveGateway_6" -> "Task_23";
  "Task_4" -> "ParallelGateway_6";
  "ParallelGateway_1" -> "Task_24";
  "Task_6" -> "EndNoneEvent_1";
  "ExclusiveGateway_6" -> "ExclusiveGateway_4";
  "ParallelGateway_2" -> "Task_1";
  "Task_21" -> "Task_3";
  "ExclusiveGateway_3" -> "Task_8";
  "Task_19" -> "ExclusiveGateway_1";
  "Task_3" -> "Task_6";
  "ExclusiveGateway_2" -> "Task_20";
  "Task_15" -> "ExclusiveGateway_6";
  "Task_18" -> "Task_9";
  "ParallelGateway_3" -> "ExclusiveGateway_5";
  "Task_20" -> "ExclusiveGateway_3";
  "Task_1" -> "Task_15";
  "Task_9" -> "ExclusiveGateway_2";
  "Task_12" -> "ExclusiveGateway_2";
}
